#  Data operations and transformations

05 01 25

This notebook illustrates how to use the Easy Pandas package that implements several different data transformations in a simplified way, that is more suitable for students who are just starting to work with data in Python.

The operations are:
- **filter**: filters the dataframe to a subset of rows that meet a particular condition
- **select**: select a subset of columns
- **sort**: order the dataframe based on the values in a specific column
- **groupby**: split the dataframe into groups, apply an aggregate function to a column within each group and then combine
- **add_column**: add a column to the dataframe with a specific set of values
- **add_derived_column**: add a column to the dataframe with values derived from another column
- **join**: join one dataframe to another

## 0. Create some data

The following code block creates the same table that is described in the data transformations section of the course materials. Let's create it and see what it looks like.


Select the cell below and hit ▶️ Run

In [1]:
# First we should import all the packages we need
import numpy as np
import pandas as pd
# !pip install geopandas
# !pip install folium
import sys
sys.path.append('/mnt/data')
from easypandas import EasyDataFrame


# Second we will define the dataset
data = {
    "Patientid": [1, 1, 2, 3, 6, 4, 5, 4, 7, 8],
    "Date": [
        "2010-11-20", "2009-01-15", "2010-07-14", "2010-07-01", "2010-06-08",
        "2011-02-02", "2010-09-21", "2009-03-03", "2010-10-12", "2011-12-21"
    ],
    "Test name": [
        "Haemoglobin", "Haemoglobin", "Platelets", "Haemoglobin", "Haemoglobin",
        "Haemoglobin", "Haemoglobin", "Haemoglobin", "Platelets", "Haemoglobin"
    ],
    "Test result": ["154", "132", "320", "145", "165", "157", "157", "139", "275", "170"],
    "Test units": ["g/L", "g/L", "N/nL", "g/L", "g/L", "g/L", "g/L", "g/L", "N/nL", "g/L"]
}

postcodes = {
    "Patientid" : [1, 3, 4],
    "state" : ["VIC", "NT", "NSW"]
}

# Finally, lets convert to DataFrame
pathology_test_data = EasyDataFrame(data)
dfpostcodes = EasyDataFrame(postcodes)
pathology_test_data["Date"] = pd.to_datetime(pathology_test_data["Date"], dayfirst=True, errors='coerce')

# Display the DataFrame
pathology_test_data

C:\Users\Mark_OES\anaconda3\lib\site-packages\scipy\__init__.py:138: UserWarning: A NumPy version >=1.16.5 and <1.23.0 is required for this version of SciPy (detected version 1.24.4)
  warnings.warn(f"A NumPy version >={np_minversion} and <{np_maxversion} is required for this version of "

   Patientid       Date    Test name Test result Test units
0          1 2010-11-20  Haemoglobin         154        g/L
1          1 2009-01-15  Haemoglobin         132        g/L
2          2 2010-07-14    Platelets         320       N/nL
3          3 2010-07-01  Haemoglobin         145        g/L
4          6 2010-06-08  Haemoglobin         165        g/L
5          4 2011-02-02  Haemoglobin         157        g/L
6          5 2010-09-21  Haemoglobin         157        g/L
7          4 2009-03-03  Haemoglobin         139        g/L
8          7 2010-10-12    Platelets         275       N/nL
9          8 2011-12-21  Haemoglobin         170        g/L

## 1. Filter

To filter a dataset means to select **only those rows that satisfy a particular logical condition**. 

In the example at the start we filtered the dataset based on the condition that a row must have a date value that corresponds to the year 2010, and a test result that corresponds to haemoglobin. We can think of the filter operation as going through each row one by one and checking each row to see if it passes the condition (i.e. meets the criteria).
 

 

Select the cell below and hit ▶️ Run

In [2]:
filtered_df = pathology_test_data[pathology_test_data["Test name"] == "Haemoglobin"]

filtered_df

   Patientid       Date    Test name Test result Test units
0          1 2010-11-20  Haemoglobin         154        g/L
1          1 2009-01-15  Haemoglobin         132        g/L
3          3 2010-07-01  Haemoglobin         145        g/L
4          6 2010-06-08  Haemoglobin         165        g/L
5          4 2011-02-02  Haemoglobin         157        g/L
6          5 2010-09-21  Haemoglobin         157        g/L
7          4 2009-03-03  Haemoglobin         139        g/L
9          8 2011-12-21  Haemoglobin         170        g/L

### 👨‍💻 Activity: Mix it up

Take the code block above and try to make some adjustments. Try filtering through a different column with a different value.

In [3]:
# Write (or copy/paste) the filter code here and then adjust!

## 2. Select

Select is a more basic operation which involves selecting a certain subset of the columns of the table. In the example below we select the two columns 'Test name' and 'Test result'.


Select the cell below and hit ▶️ Run

In [4]:
pathology_test_data.select(['Test name', 'Test result'])

     Test name Test result
0  Haemoglobin         154
1  Haemoglobin         132
2    Platelets         320
3  Haemoglobin         145
4  Haemoglobin         165
5  Haemoglobin         157
6  Haemoglobin         157
7  Haemoglobin         139
8    Platelets         275
9  Haemoglobin         170

### 👨‍💻 Activity: Mix it up

Take the code block above and try to make some adjustments. Try selecting some different columns.

In [5]:
# Write (or copy/paste) the filter code here and then adjust!

# Functions
A function is a mathematical object that **takes an input** and **produces a single well-defined output**. Below are two examples of two different functions that we may encounter or that we may choose to define ourselves. Note that a function may produce the same value for two different input values but cannot produce two different output values for a single input value. For example, calculating a patient’s Body Mass Index is a function – you input the weight and height, and it produces one output value (the BMI). 


IMAGE

## 3. Group by

Group by is a slightly more complex but particularly useful operation. It involves splitting rows of the table into groups, and then separately applying an operation to values within each group. In the example below the data is separated based on the blood test name and then within each group the maximum value of the blood test result is calculated.

Select the cell below and hit ▶️ Run

In [6]:
pathology_test_data.groupby('Test name', 'Test result', 'max')

     Test name Test result
0  Haemoglobin         170
1    Platelets         320

This operation allows us to aggregate information within an entire group. We may want to use a dataset of heights of male and female patients to calculate the average height of men and women in Australia. In this case we would group the data by sex and then within each group calculate the average of the height variable.

### 👨‍💻 **Activity: Mix it up**

Take the code block above and try to make some adjustments. Try finding the minimum or mixing up the groups. 

You can adjust the code above and re-run the cell. Or you can add a cell below by pressing the ➕ icon in the top menu.

## 4. Sort

Sometimes we would like to transform a table so that it is ordered in a particular way. In the example below the sort operation is applied to produce a new table where the rows are ordered by ascending date, with earlier dates appearing higher in the table. 

Select the cell below and hit ▶️ Run

In [7]:
pathology_test_data.sort('Date', 'ascending')

   Patientid       Date    Test name Test result Test units
1          1 2009-01-15  Haemoglobin         132        g/L
7          4 2009-03-03  Haemoglobin         139        g/L
4          6 2010-06-08  Haemoglobin         165        g/L
3          3 2010-07-01  Haemoglobin         145        g/L
2          2 2010-07-14    Platelets         320       N/nL
6          5 2010-09-21  Haemoglobin         157        g/L
8          7 2010-10-12    Platelets         275       N/nL
0          1 2010-11-20  Haemoglobin         154        g/L
5          4 2011-02-02  Haemoglobin         157        g/L
9          8 2011-12-21  Haemoglobin         170        g/L

### 👨‍💻 **Mix it up**

Take the code block above and try to make some adjustments.

## 5. Add column

It is also useful to add additional columns to a table, either with new information or as the result of applying a function to existing columns. In the example below a new column is added to the original table by extracting the name of the month from the date column.

Select the cell below and hit ▶️ Run

In [8]:
# The following code chunk will get the month. You can ignore it
def get_month(date):
    return date.strftime('%B') if pd.notnull(date) else None

# This is the code where we add the column

pathology_test_data.add_derived_column('Date', 'month_name', get_month)

   Patientid       Date    Test name Test result Test units month_name
0          1 2010-11-20  Haemoglobin         154        g/L   November
1          1 2009-01-15  Haemoglobin         132        g/L    January
2          2 2010-07-14    Platelets         320       N/nL       July
3          3 2010-07-01  Haemoglobin         145        g/L       July
4          6 2010-06-08  Haemoglobin         165        g/L       June
5          4 2011-02-02  Haemoglobin         157        g/L   February
6          5 2010-09-21  Haemoglobin         157        g/L  September
7          4 2009-03-03  Haemoglobin         139        g/L      March
8          7 2010-10-12    Platelets         275       N/nL    October
9          8 2011-12-21  Haemoglobin         170        g/L   December

### 👨‍💻 **Mix it up**

Take the code block above and try to make some adjustments.

## 6.Joins

Finally, a slightly more complex set of transformations involves joining two different tables in a way that combines information from both. We won’t spend too much time on these, and you are not expected to understand these in detail. However, if you are interested, four of the main join operations are but summarised below. 

We care going to use the following Postcodes table as our second table. And let's place our original table here for reference too.

In [9]:
dfpostcodes

   Patientid state
0          1   VIC
1          3    NT
2          4   NSW

In [10]:
pathology_test_data

   Patientid       Date    Test name Test result Test units
0          1 2010-11-20  Haemoglobin         154        g/L
1          1 2009-01-15  Haemoglobin         132        g/L
2          2 2010-07-14    Platelets         320       N/nL
3          3 2010-07-01  Haemoglobin         145        g/L
4          6 2010-06-08  Haemoglobin         165        g/L
5          4 2011-02-02  Haemoglobin         157        g/L
6          5 2010-09-21  Haemoglobin         157        g/L
7          4 2009-03-03  Haemoglobin         139        g/L
8          7 2010-10-12    Platelets         275       N/nL
9          8 2011-12-21  Haemoglobin         170        g/L

### 6.1 Left join 

This results in a new table containing all the information from the table on the left but may not contain all the information from the table on the right. 

A **Left Join** returns all records from the left table and the matched records from the right table.

- ✅ All rows from the left table are included.
- ✅ Matching rows from the right table are included.
- ❌ If there is no match, NULLs/NaN are returned for columns from the right table.

Now let's, perform the join.

In [12]:
pathology_test_data.join(dfpostcodes, left_on='Patientid', right_on='Patientid', how='left')

   Patientid       Date    Test name Test result Test units state
0          1 2010-11-20  Haemoglobin         154        g/L   VIC
1          1 2009-01-15  Haemoglobin         132        g/L   VIC
2          2 2010-07-14    Platelets         320       N/nL   NaN
3          3 2010-07-01  Haemoglobin         145        g/L    NT
4          6 2010-06-08  Haemoglobin         165        g/L   NaN
5          4 2011-02-02  Haemoglobin         157        g/L   NSW
6          5 2010-09-21  Haemoglobin         157        g/L   NaN
7          4 2009-03-03  Haemoglobin         139        g/L   NSW
8          7 2010-10-12    Platelets         275       N/nL   NaN
9          8 2011-12-21  Haemoglobin         170        g/L   NaN

### 6.2 Right join
This results in a new table containing all the information from the table on the right but may not contain all the information from the table on the left.

- ✅ All rows from the right table are included.
- ✅ Matching rows from the left table are included.
- ❌ If there is no match, NULLs are returned for columns from the left table.

In [13]:
pathology_test_data.join(dfpostcodes, left_on='Patientid', right_on='Patientid', how='right')

   Patientid       Date    Test name Test result Test units state
0          1 2010-11-20  Haemoglobin         154        g/L   VIC
1          1 2009-01-15  Haemoglobin         132        g/L   VIC
2          3 2010-07-01  Haemoglobin         145        g/L    NT
3          4 2011-02-02  Haemoglobin         157        g/L   NSW
4          4 2009-03-03  Haemoglobin         139        g/L   NSW

### 6.3 Inner join

An **inner join** results in a new table that:

- ✅ Records with matching keys in both tables are included.
- ❌ Records with no match in either table are excluded.

In [14]:
pathology_test_data.join(dfpostcodes, left_on='Patientid', right_on='Patientid', how='inner')

   Patientid       Date    Test name Test result Test units state
0          1 2010-11-20  Haemoglobin         154        g/L   VIC
1          1 2009-01-15  Haemoglobin         132        g/L   VIC
2          3 2010-07-01  Haemoglobin         145        g/L    NT
3          4 2011-02-02  Haemoglobin         157        g/L   NSW
4          4 2009-03-03  Haemoglobin         139        g/L   NSW

### 6.4 Outer join
A **Outer Join** returns all records when there is a match in either the left or right table.

- ✅ All rows from the left table are included.
- ✅ All rows from the right table are included.
- ✅ Matching rows from both tables are joined.
- ❌ Where there is no match, NULLs are returned for missing columns from the opposite table.

In [15]:
pathology_test_data.join(dfpostcodes, left_on='Patientid', right_on='Patientid', how='outer')

   Patientid       Date    Test name Test result Test units state
0          1 2010-11-20  Haemoglobin         154        g/L   VIC
1          1 2009-01-15  Haemoglobin         132        g/L   VIC
2          2 2010-07-14    Platelets         320       N/nL   NaN
3          3 2010-07-01  Haemoglobin         145        g/L    NT
4          6 2010-06-08  Haemoglobin         165        g/L   NaN
5          4 2011-02-02  Haemoglobin         157        g/L   NSW
6          4 2009-03-03  Haemoglobin         139        g/L   NSW
7          5 2010-09-21  Haemoglobin         157        g/L   NaN
8          7 2010-10-12    Platelets         275       N/nL   NaN
9          8 2011-12-21  Haemoglobin         170        g/L   NaN

## Combining multiple data transformation operations

Now we understand each of the operations individually, we can combine them in a sequence of transformations. Give these a shot!

### Exercise one

Get the maximum blood test result for each blood test, then sort from smallest to largest

### Exercise two

Filter the data to haemoglobin results, then sort by patientid in reverse order, select the blood test name and result columns and then add a new column that labels the rows